TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/driverlib/empty_driverlib_src/ti/driverlib/m0p/dl_factoryregion.h
    return flashSize;
}

/**
 *  @brief   Get the size of the DATA Flash region
 *
 *  @return  The size of the DATA Flash region in number of kB.
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getDATAFlashSize(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t flashSize;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        flashSize = (FACTORYVALUE->SRAMFLASH &
                        FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_MASK) >>
                    FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_OFS;
    } else {
        flashSize = (FACTORYREGION->SRAMFLASH &
                        FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_MASK) >>
                    FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_OFS;
    }
#else
    uint16_t flashSize = (FACTORYREGION->SRAMFLASH &
                             FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_MASK) >>
                         FACTORYREGION_SRAMFLASH_DATAFLASH_SZ_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return flashSize;
}

/**
 *  @brief   Get the number of Flash banks on the device
 *
 *  @return  The number of flash banks. A value between [1, 4].
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getNumBanks(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t numBanks;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        numBanks = ((FACTORYVALUE->SRAMFLASH &
                        FACTORYREGION_SRAMFLASH_MAINNUMBANKS_MASK) >>
                       FACTORYREGION_SRAMFLASH_MAINNUMBANKS_OFS) +
                   (uint8_t) 1;
    } else {
        numBanks = ((FACTORYREGION->SRAMFLASH &
                        FACTORYREGION_SRAMFLASH_MAINNUMBANKS_MASK) >>
                       FACTORYREGION_SRAMFLASH_MAINNUMBANKS_OFS) +
                   (uint8_t) 1;
    }
#else
    uint8_t numBanks = ((FACTORYREGION->SRAMFLASH &
                            FACTORYREGION_SRAMFLASH_MAINNUMBANKS_MASK) >>
                           FACTORYREGION_SRAMFLASH_MAINNUMBANKS_OFS) +
                       (uint8_t) 1;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return numBanks;
}

/**
 *  @brief   Get the trace ID of the device
 *
 *  @return  The trace ID of the device.
 */
__STATIC_INLINE uint32_t DL_FactoryRegion_getTraceID(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint32_t traceID;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        traceID = FACTORYVALUE->TRACEID & FACTORYREGION_TRACEID_DATA_MASK;
    } else {
        traceID = FACTORYREGION->TRACEID & FACTORYREGION_TRACEID_DATA_MASK;
    }
#else
    uint32_t traceID =
        FACTORYREGION->TRACEID & FACTORYREGION_TRACEID_DATA_MASK;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return traceID;
}

/**
 *  @brief   Get JEDEC bank and company code
 *
 *  @return  TI's JEDEC bank and company code
 */
__STATIC_INLINE uint16_t DL_FactoryRegion_getManufacturerCode(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t manufacturerCode;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        manufacturerCode = (FACTORYVALUE->DEVICEID &
                               FACTORYREGION_DEVICEID_MANUFACTURER_MASK) >>
                           FACTORYREGION_DEVICEID_MANUFACTURER_OFS;
    } else {
        manufacturerCode = (FACTORYREGION->DEVICEID &
                               FACTORYREGION_DEVICEID_MANUFACTURER_MASK) >>
                           FACTORYREGION_DEVICEID_MANUFACTURER_OFS;
    }
#else
    uint16_t manufacturerCode =
        (FACTORYREGION->DEVICEID & FACTORYREGION_DEVICEID_MANUFACTURER_MASK) >>
        FACTORYREGION_DEVICEID_MANUFACTURER_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return manufacturerCode;
}

/**
 *  @brief   Get the part number of the device
 *
 *  @return  The part number of the device
 */
__STATIC_INLINE uint16_t DL_FactoryRegion_getPartNumber(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t partNumber;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        partNumber =
            (FACTORYVALUE->DEVICEID & FACTORYREGION_DEVICEID_PARTNUM_MASK) >>
            FACTORYREGION_DEVICEID_PARTNUM_OFS;
    } else {
        partNumber =
            (FACTORYREGION->DEVICEID & FACTORYREGION_DEVICEID_PARTNUM_MASK) >>
            FACTORYREGION_DEVICEID_PARTNUM_OFS;
    }
#else
    uint16_t partNumber =
        (FACTORYREGION->DEVICEID & FACTORYREGION_DEVICEID_PARTNUM_MASK) >>
        FACTORYREGION_DEVICEID_PARTNUM_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return partNumber;
}

/**
 *  @brief   Get the version of the device
 *
 *  @return  The version of the device
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getVersion(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t version;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        version =
            (FACTORYVALUE->DEVICEID & FACTORYREGION_DEVICEID_VERSION_MASK) >>
            FACTORYREGION_DEVICEID_VERSION_OFS;
    } else {
        version =
            (FACTORYREGION->DEVICEID & FACTORYREGION_DEVICEID_VERSION_MASK) >>
            FACTORYREGION_DEVICEID_VERSION_OFS;
    }
#else
    uint8_t version =
        (FACTORYREGION->DEVICEID & FACTORYREGION_DEVICEID_VERSION_MASK) >>
        FACTORYREGION_DEVICEID_VERSION_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return version;
}

/**
 *  @brief   Get the bit pattern identifying the part
 *
 *  @return  The bit pattern identifying the part
 */
__STATIC_INLINE uint16_t DL_FactoryRegion_getUserIDPart(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint16_t userIDPart;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        userIDPart = (FACTORYVALUE->USERID & FACTORYREGION_USERID_PART_MASK) >>
                     FACTORYREGION_USERID_PART_OFS;
    } else {
        userIDPart =
            (FACTORYREGION->USERID & FACTORYREGION_USERID_PART_MASK) >>
            FACTORYREGION_USERID_PART_OFS;
    }
#else
    uint16_t userIDPart =
        (FACTORYREGION->USERID & FACTORYREGION_USERID_PART_MASK) >>
        FACTORYREGION_USERID_PART_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return userIDPart;
}

/**
 *  @brief   Get the bit pattern identifying a variant of a part
 *
 *  @return  The bit pattern identifying a variant of a part
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getUserIDVariant(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t userIDVariant;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        userIDVariant =
            (FACTORYVALUE->USERID & FACTORYREGION_USERID_VARIANT_MASK) >>
            FACTORYREGION_USERID_VARIANT_OFS;
    } else {
        userIDVariant =
            (FACTORYREGION->USERID & FACTORYREGION_USERID_VARIANT_MASK) >>
            FACTORYREGION_USERID_VARIANT_OFS;
    }
#else
    uint8_t userIDVariant =
        (FACTORYREGION->USERID & FACTORYREGION_USERID_VARIANT_MASK) >>
        FACTORYREGION_USERID_VARIANT_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return userIDVariant;
}

/**
 *  @brief   Get the value that preserves compatibility with lesser minorrev values
 *
 *  Monotonic increasing value indicating a new revision that preserves
 *  compatibility with lesser minorrev values. New capability may
 *  be introduced such that lesser minorrev numbers may not be
 *  compatible with greater if the new capability is used
 *
 *  @return  The value that preserves compatibility with lesser minorrev values
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getUserIDMinorRev(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t minorRev;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        minorRev =
            (FACTORYVALUE->USERID & FACTORYREGION_USERID_MINORREV_MASK) >>
            FACTORYREGION_USERID_MINORREV_OFS;
    } else {
        minorRev =
            (FACTORYREGION->USERID & FACTORYREGION_USERID_MINORREV_MASK) >>
            FACTORYREGION_USERID_MINORREV_OFS;
    }
#else
    uint8_t minorRev =
        (FACTORYREGION->USERID & FACTORYREGION_USERID_MINORREV_MASK) >>
        FACTORYREGION_USERID_MINORREV_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return minorRev;
}

/**
 *  @brief   Get the value that preserves compatibility with lesser majorrev values
 *
 *  Monotonic increasing value indicating a new revision significant
 *  enough that users of the device may have to revise PCB or or
 *  software design
 *
 *  @return  The value that tells users they may have to revise PCB or majorrev design
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getUserIDMajorRev(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t majorRev;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        majorRev =
            (FACTORYVALUE->USERID & FACTORYREGION_USERID_MAJORREV_MASK) >>
            FACTORYREGION_USERID_MAJORREV_OFS;
    } else {
        majorRev =
            (FACTORYREGION->USERID & FACTORYREGION_USERID_MAJORREV_MASK) >>
            FACTORYREGION_USERID_MAJORREV_OFS;
    }
#else
    uint8_t majorRev =
        (FACTORYREGION->USERID & FACTORYREGION_USERID_MAJORREV_MASK) >>
        FACTORYREGION_USERID_MAJORREV_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

