TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/driverlib/empty_driverlib_src/ti/driverlib/m0p/dl_factoryregion.h
    return bslI2CSCLFunction;
}

/**
 *  @brief   Get the GPIO level used by BSL pin invocation
 *
 *  @return  The GPIO level used by BSL pin invocation
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinInvokeGPIOLevel(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslInvokeGPIOLevel;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslInvokeGPIOLevel =
            (FACTORYVALUE->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_OFS;
    } else {
        bslInvokeGPIOLevel =
            (FACTORYREGION->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_OFS;
    }
#else
    uint8_t bslInvokeGPIOLevel =
        (FACTORYREGION->BSLPIN_INVOKE &
            FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_MASK) >>
        FACTORYREGION_BSLPIN_INVOKE_GPIO_LEVEL_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslInvokeGPIOLevel;
}

/**
 *  @brief   Get the GPIO Pin selection value used by BSL pin invocation
 *
 *  @return  The GPIO Pin selection value used by BSL pin invocation
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinInvokeGPIOPin(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslInvokeGPIOPin;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslInvokeGPIOPin =
            (FACTORYVALUE->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_OFS;
    } else {
        bslInvokeGPIOPin =
            (FACTORYREGION->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_OFS;
    }
#else
    uint8_t bslInvokeGPIOPin =
        (FACTORYREGION->BSLPIN_INVOKE &
            FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_MASK) >>
        FACTORYREGION_BSLPIN_INVOKE_GPIO_PIN_SEL_OFS;
#endif
    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslInvokeGPIOPin;
}

/**
 *  @brief   Get the GPIO module selection used by BSL pin invocation
 *
 *  @return  The GPIO module selection used by BSL pin invocation
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinInvokeGPIOModule(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslInvokeGPIOModule;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslInvokeGPIOModule =
            (FACTORYVALUE->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_OFS;
    } else {
        bslInvokeGPIOModule =
            (FACTORYREGION->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_OFS;
    }
#else
    uint8_t bslInvokeGPIOModule =
        (FACTORYREGION->BSLPIN_INVOKE &
            FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_MASK) >>
        FACTORYREGION_BSLPIN_INVOKE_GPIO_REG_SEL_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslInvokeGPIOModule;
}

/**
 *  @brief   Get the BSL invocation pin number
 *
 *  @return  The BSL invocation pin number
 */
__STATIC_INLINE uint8_t DL_FactoryRegion_getBSLPinInvokeGPIOModulePad(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint8_t bslInvokeGPIOModulePad;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        bslInvokeGPIOModulePad =
            (FACTORYVALUE->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_OFS;
    } else {
        bslInvokeGPIOModulePad =
            (FACTORYREGION->BSLPIN_INVOKE &
                FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_MASK) >>
            FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_OFS;
    }
#else
    uint8_t bslInvokeGPIOModulePad =
        (FACTORYREGION->BSLPIN_INVOKE &
            FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_MASK) >>
        FACTORYREGION_BSLPIN_INVOKE_BSL_PAD_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return bslInvokeGPIOModulePad;
}

/**
 *  @brief   Get the ADC conversion results of temperature sensor output voltage
 *
 * Returns the temperature sensor output voltage at the factory trim temperature
 * in ADC result code format. This ADC result code is based upon 12-bit
 * sampling mode together with the 1.4-V internal voltage reference.
 *
 *  @return  The ADC conversion results of temperature sensor output voltage
 */
__STATIC_INLINE uint32_t DL_FactoryRegion_getTemperatureVoltage(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

#ifdef __MSPM0GX51X_TRIM_CACHE__
    uint32_t tempVoltage;
    if (DL_FactoryRegion_isTrimTableInSram()) {
        tempVoltage = (FACTORYVALUE->TEMP_SENSE0 &
                          FACTORYREGION_TEMP_SENSE0_DATA_MASK) >>
                      FACTORYREGION_TEMP_SENSE0_DATA_OFS;
    } else {
        tempVoltage = (FACTORYREGION->TEMP_SENSE0 &
                          FACTORYREGION_TEMP_SENSE0_DATA_MASK) >>
                      FACTORYREGION_TEMP_SENSE0_DATA_OFS;
    }
#else
    uint32_t tempVoltage =
        (FACTORYREGION->TEMP_SENSE0 & FACTORYREGION_TEMP_SENSE0_DATA_MASK) >>
        FACTORYREGION_TEMP_SENSE0_DATA_OFS;
#endif

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return tempVoltage;
}

/**
 *  @brief   Get the BOOTCRC value
 *
 *  The 32-bit CRC of all locations in OPEN including reserved locations.
 *
 *  @return  The BOOTCRC value
 */
__STATIC_INLINE uint32_t DL_FactoryRegion_getBOOTCRCData(void)
{
    /* Save CPUSS state and then disable the cache before TRIM access */
    uint32_t ctlTemp = DL_CORE_getInstructionConfig();
    DL_CORE_configInstruction(DL_CORE_PREFETCH_ENABLED, DL_CORE_CACHE_DISABLED,
        DL_CORE_LITERAL_CACHE_ENABLED);

    uint32_t BOOTCRCData =
        (FACTORYREGION->BOOTCRC & FACTORYREGION_BOOTCRC_DATA_MASK) >>
        FACTORYREGION_BOOTCRC_DATA_OFS;

    /* Restore CPUSS state */
    CPUSS->CTL = ctlTemp;

    return BOOTCRCData;
}

#ifdef __MSPM0GX51X_TRIM_CACHE__
/**
 *  @brief Initializes the struct with values from TRIM
 *
 *  Workaround for TRIM region becoming unreadable upon
 *  setting flash wait states equal to 2 on MSPM0GX51X
 *  devices.
 *
 */
void DL_FactoryRegion_initTrimTable(void);
#endif

#ifdef __MSPM0C110X_ADC_ERR_06__
/**
 *  @brief Get the ADC offset value
 *
 *  Workaround for errata on MSPM0C110x devices: ADC_ERR_06
 *  0x41C40040 is expected to point to factory region reserved0 bit
 *
 *  @return  ADC offset value
 */
__STATIC_INLINE float DL_FactoryRegion_getADCOffset(void)
{
    return ((float) (*(int16_t *) (0x41C40040)));
}
#endif

#ifdef __cplusplus
}
#endif

#endif /* ti_dl_dl_factoryregion__include */
/** @}*/
